{
	"rules_info": {
		"heading": {
			"title": "Faithful Discord Server Rules",
			"description": "Not knowing these is not an excuse for misbehaving, and you can and will be held accountable for your actions. Punishments are up to the discretion of the moderators, and harassing them is only going to make your punishment worse.\n\n*Use `e!modping` or directly ping an online moderator if rules are being broken. **Please do not mini-mod!***"
		},
		"expanded_rules": {
			"title": "Were you warned or muted unfairly?",
			"description": "A much more in-depth version of our rules, punishment appeal information, and our thought process into giving punishments can be found here: https://docs.faithfulpack.net/pages/manuals/expanded-server-rules"
		},
		"changes": {
			"title": "Last Update: 2 July 2024",
			"description": "Clarify rule 9 and fixed grammar in rule 8.",
			"footer": "The rules are subject to change at any time for any reason.",
			"enabled": true
		}
	},
	"rules": [
		{
			"title": "1️⃣ Read & Follow Discord’s Terms of Service and Community Guidelines",
			"description": "You can find them at https://discord.com/terms and https://discord.com/guidelines respectively. This includes misuse of client modifications (e.g. message loggers) and discussion or promotion of illegal activity."
		},
		{
			"title": "2️⃣ Use Common Sense",
			"description": "This is the generic \"don’t be an idiot\" rule. Prohibited actions include using hate speech or slurs, joking about tragedies or other sensitive topics, raiding or brigading other servers, or spreading misinformation."
		},
		{
			"title": "3️⃣ Speak English",
			"description": "People and by extension moderators can't know what you're saying otherwise, as this is an English-speaking server. Please use a [translator](https://www.deepl.com/translator) if you cannot fluently understand English."
		},
		{
			"title": "4️⃣ Be Constructive and Polite",
			"description": "Give constructive criticism people can use to improve their work, not just say that something is ugly or bad. Swearing is allowed within reason, however don’t cross the line into harassment."
		},
		{
			"title": "5️⃣ Try to Not Annoy Others",
			"description": "This includes overly (reply) pinging, sending loud audio or seizure-inducing videos without a spoiler/disclaimer, and abusing nicknames, reactions, or spoilers. Don’t [ask to ask](https://dontasktoask.com), instead just ask your question directly to save everybody time."
		},
		{
			"title": "6️⃣ Don’t Clutter Chats",
			"description": "While short tangents are fine, we have multiple channels for a reason, so please use them as intended. Spamming random things, including emojis and stickers, or starting a chat chain contributes nothing to a conversation and only causes a mess."
		},
		{
			"title": "7️⃣ Avoid NSFW and NSFL Content",
			"description": "This includes, but is not limited to pornography, gore, and overly gross content; if you think it’s against the rules it probably will be. You can DM a moderator for approval with borderline content."
		},
		{
			"title": "8️⃣ Stay Away From Political Discussion",
			"description": "General discussion about real-life events is still allowed from a more neutral perspective. If you really want to discuss politics, take it to direct messages or another server."
		},
		{
			"title": "9️⃣ No Unsolicited Promoting or Advertising",
			"description": "Any advertising must be done in context, and spamming or direct messaging advertisements will lead to an instant ban and report to Discord. Additionally, please refrain from requesting or making monetary transactions, including with cryptocurrencies, on the server."
		},
		{
			"title": "🔟 Don’t Leak Private Information",
			"description": "What happens in private channels stays in those channels; keep any confidential information you may have private. Doxxing will get you reported to Discord and banned from the servers."
		}
	],
	"server": [
		{
			"title": "1️⃣ Read & Follow the Rules of the Faithful Discord Servers",
			"description": "The Faithful Discord rules extend to the Minecraft server as well. You can find them over at <#773991747549921301>, or see the [expanded rules](https://docs.faithfulpack.net/pages/manuals/expanded-server-rules) on our docs site."
		},
		{
			"title": "2️⃣ Don’t Grief Others' Builds",
			"description": "Always consult the original builder before making any changes to something you didn’t create. There is no claim system in any of the worlds – As such, please only build where nobody has built yet and where it seems logical to build."
		},
		{
			"title": "3️⃣ Don’t Steal",
			"description": "Don’t take anything from containers that aren't yours, and always pay full price when trading unless agreed otherwise."
		},
		{
			"title": "4️⃣ Don’t Hack, Cheat or Use Game-Breaking Exploits",
			"description": "The goal of playing on this server is to have fun. Using cheats, hacks or exploits to gain an unfair advantage is not fun. This includes malicious mods, hacked clients and other programs, as well as exploiting vanilla bugs such as item duplication."
		},
		{
			"title": "5️⃣ Build Appropriately",
			"description": "Improper or otherwise malicious builds (obscene creations, player traps, lag/crash machines) will not be tolerated."
		}
	]
}